benchmarks/vllm/runpod_h100sxm/Qwen3-14B/benchmaq-h100x8-sxm-perf_qwen3_14b_TP4_DP2_in4096_out128_p500_c100_f48aa2.txt
BENCHMARK: benchmaq-h100x8-sxm-perf_qwen3_14b_TP4_DP2_in4096_out128_p500_c100_f48aa2
================================================================
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x72a1d21a9ee0>, seed=0, num_prompts=500, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=4096, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=100, model='/workspace/models/Qwen3-14B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='./benchmarks/runpod_h100sxm/Qwen3-14B', result_filename='benchmaq-h100x8-sxm-perf_qwen3_14b_TP4_DP2_in4096_out128_p500_c100_f48aa2.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, request_id_prefix='bench-e2e63ea0-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 04-09 04:03:55 [datasets.py:612] Sampling input_len from [4096, 4096] and output_len from [128, 128]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 100

  0%|          | 0/500 [00:00<?, ?it/s]
  0%|          | 1/500 [00:04<36:21,  4.37s/it]
  0%|          | 2/500 [00:04<15:46,  1.90s/it]
  4%|▍         | 20/500 [00:04<00:59,  8.04it/s]
  5%|▌         | 27/500 [00:04<00:41, 11.43it/s]
  7%|▋         | 34/500 [00:05<00:32, 14.13it/s]
  8%|▊         | 40/500 [00:05<00:26, 17.26it/s]
  9%|▉         | 45/500 [00:05<00:22, 19.99it/s]
 10%|█         | 50/500 [00:05<00:22, 20.08it/s]
 11%|█         | 54/500 [00:05<00:20, 21.58it/s]
 12%|█▏        | 58/500 [00:05<00:19, 23.26it/s]
 12%|█▏        | 62/500 [00:05<00:17, 24.74it/s]
 13%|█▎        | 66/500 [00:06<00:16, 25.96it/s]
 14%|█▍        | 70/500 [00:06<00:15, 27.02it/s]
 15%|█▍        | 74/500 [00:06<00:15, 27.66it/s]
 16%|█▌        | 78/500 [00:06<00:14, 28.26it/s]
 16%|█▋        | 82/500 [00:06<00:14, 28.62it/s]
 17%|█▋        | 86/500 [00:06<00:14, 28.88it/s]
 18%|█▊        | 90/500 [00:06<00:14, 29.26it/s]
 19%|█▉        | 94/500 [00:07<00:13, 29.61it/s]
 20%|█▉        | 98/500 [00:07<00:13, 29.06it/s]
 20%|██        | 101/500 [00:08<01:03,  6.26it/s]
 21%|██        | 104/500 [00:08<00:50,  7.78it/s]
 25%|██▌       | 125/500 [00:09<00:15, 24.89it/s]
 26%|██▋       | 132/500 [00:09<00:12, 29.49it/s]
 28%|██▊       | 139/500 [00:09<00:12, 28.73it/s]
 29%|██▉       | 145/500 [00:09<00:12, 28.24it/s]
 30%|███       | 150/500 [00:09<00:11, 29.99it/s]
 31%|███       | 155/500 [00:10<00:11, 29.15it/s]
 32%|███▏      | 159/500 [00:10<00:11, 29.22it/s]
 33%|███▎      | 163/500 [00:10<00:11, 29.36it/s]
 33%|███▎      | 167/500 [00:10<00:11, 29.43it/s]
 34%|███▍      | 171/500 [00:10<00:11, 29.81it/s]
 35%|███▌      | 175/500 [00:10<00:10, 29.81it/s]
 36%|███▌      | 179/500 [00:10<00:10, 29.51it/s]
 37%|███▋      | 183/500 [00:10<00:10, 29.70it/s]
 37%|███▋      | 187/500 [00:11<00:10, 29.43it/s]
 38%|███▊      | 191/500 [00:11<00:10, 29.41it/s]
 39%|███▉      | 194/500 [00:11<00:11, 27.26it/s]
 39%|███▉      | 197/500 [00:11<00:15, 19.98it/s]
 40%|████      | 200/500 [00:11<00:14, 20.60it/s]
 41%|████      | 203/500 [00:13<00:55,  5.39it/s]
 44%|████▍     | 220/500 [00:13<00:17, 16.25it/s]
 45%|████▌     | 227/500 [00:13<00:13, 20.37it/s]
 47%|████▋     | 233/500 [00:13<00:10, 24.54it/s]
 48%|████▊     | 239/500 [00:13<00:09, 26.57it/s]
 49%|████▉     | 245/500 [00:14<00:09, 26.93it/s]
 50%|█████     | 250/500 [00:14<00:09, 27.10it/s]
 51%|█████     | 254/500 [00:14<00:08, 27.34it/s]
 52%|█████▏    | 258/500 [00:14<00:08, 27.74it/s]
 52%|█████▏    | 262/500 [00:14<00:08, 28.41it/s]
 53%|█████▎    | 266/500 [00:14<00:08, 28.75it/s]
 54%|█████▍    | 270/500 [00:14<00:07, 29.06it/s]
 55%|█████▍    | 274/500 [00:15<00:07, 29.18it/s]
 56%|█████▌    | 278/500 [00:15<00:07, 29.51it/s]
 56%|█████▋    | 282/500 [00:15<00:07, 29.61it/s]
 57%|█████▋    | 286/500 [00:15<00:07, 29.38it/s]
 58%|█████▊    | 290/500 [00:15<00:07, 29.47it/s]
 59%|█████▊    | 293/500 [00:15<00:07, 27.38it/s]
 59%|█████▉    | 296/500 [00:15<00:07, 25.96it/s]
 60%|█████▉    | 299/500 [00:16<00:10, 19.21it/s]
 60%|██████    | 302/500 [00:17<00:36,  5.36it/s]
 65%|██████▍   | 324/500 [00:17<00:09, 19.12it/s]
 66%|██████▋   | 332/500 [00:18<00:07, 23.45it/s]
 68%|██████▊   | 338/500 [00:18<00:06, 24.47it/s]
 69%|██████▉   | 344/500 [00:18<00:06, 25.89it/s]
 70%|██████▉   | 349/500 [00:18<00:05, 27.74it/s]
 71%|███████   | 354/500 [00:18<00:05, 27.13it/s]
 72%|███████▏  | 358/500 [00:18<00:05, 27.69it/s]
 72%|███████▏  | 362/500 [00:19<00:04, 28.19it/s]
 73%|███████▎  | 366/500 [00:19<00:04, 28.56it/s]
 74%|███████▍  | 370/500 [00:19<00:04, 29.15it/s]
 75%|███████▍  | 374/500 [00:19<00:04, 29.52it/s]
 76%|███████▌  | 378/500 [00:19<00:04, 30.00it/s]
 76%|███████▋  | 382/500 [00:19<00:03, 29.74it/s]
 77%|███████▋  | 386/500 [00:19<00:03, 29.78it/s]
 78%|███████▊  | 390/500 [00:19<00:03, 29.96it/s]
 79%|███████▉  | 394/500 [00:20<00:03, 30.01it/s]
 80%|███████▉  | 398/500 [00:20<00:04, 24.38it/s]
 80%|████████  | 401/500 [00:22<00:17,  5.56it/s]
 86%|████████▌ | 430/500 [00:22<00:03, 22.59it/s]
 97%|█████████▋| 485/500 [00:22<00:00, 63.99it/s]
100%|██████████| 500/500 [00:22<00:00, 22.26it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     500       
Failed requests:                         0         
Maximum request concurrency:             100       
Benchmark duration (s):                  22.46     
Total input tokens:                      2048000   
Total generated tokens:                  64000     
Request throughput (req/s):              22.26     
Output token throughput (tok/s):         2849.19   
Peak output token throughput (tok/s):    9720.00   
Peak concurrent requests:                144.00    
Total token throughput (tok/s):          94023.16  
---------------Time to First Token----------------
Mean TTFT (ms):                          1047.94   
Median TTFT (ms):                        928.48    
P99 TTFT (ms):                           3430.93   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          26.92     
Median TPOT (ms):                        28.60     
P99 TPOT (ms):                           33.74     
---------------Inter-token Latency----------------
Mean ITL (ms):                           26.92     
Median ITL (ms):                         9.94      
P99 ITL (ms):                            136.82    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          4466.73   
Median E2EL (ms):                        4436.38   
P99 E2EL (ms):                           7025.61   
==================================================