benchmarks/vllm/runpod_h100sxm/Qwen3-14B/qwen3_14b_TP8_DP1_in1024_out128_p1000_c50_f1ba91.txt
BENCHMARK: qwen3_14b_TP8_DP1_in1024_out128_p1000_c50_f1ba91
================================================================
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x767cad38cea0>, seed=0, num_prompts=1000, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=50, model='/root/models/Qwen3-14B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='./benchmarks/vllm/runpod_h100sxm/Qwen3-14B', result_filename='qwen3_14b_TP8_DP1_in1024_out128_p1000_c50_f1ba91.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, request_id_prefix='bench-8239d273-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 04-10 09:36:46 [datasets.py:612] Sampling input_len from [1024, 1024] and output_len from [128, 128]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 50

  0%|          | 0/1000 [00:00<?, ?it/s]
  0%|          | 1/1000 [00:01<21:16,  1.28s/it]
  0%|          | 2/1000 [00:01<10:15,  1.62it/s]
  5%|▌         | 51/1000 [00:02<00:35, 26.88it/s]
  5%|▌         | 54/1000 [00:02<00:37, 25.53it/s]
 10%|█         | 101/1000 [00:03<00:26, 34.05it/s]
 10%|█         | 104/1000 [00:04<00:27, 32.10it/s]
 15%|█▌        | 151/1000 [00:05<00:22, 37.08it/s]
 15%|█▌        | 154/1000 [00:05<00:24, 34.43it/s]
 20%|██        | 201/1000 [00:06<00:20, 38.49it/s]
 20%|██        | 205/1000 [00:06<00:22, 36.06it/s]
 25%|██▌       | 251/1000 [00:07<00:19, 38.89it/s]
 26%|██▌       | 255/1000 [00:07<00:20, 36.41it/s]
 30%|███       | 301/1000 [00:09<00:17, 39.26it/s]
 30%|███       | 305/1000 [00:09<00:19, 36.54it/s]
 35%|███▌      | 351/1000 [00:10<00:16, 39.59it/s]
 36%|███▌      | 355/1000 [00:10<00:17, 36.53it/s]
 40%|████      | 401/1000 [00:11<00:15, 39.69it/s]
 40%|████      | 405/1000 [00:11<00:16, 36.28it/s]
 45%|████▌     | 451/1000 [00:12<00:13, 39.74it/s]
 46%|████▌     | 455/1000 [00:13<00:15, 36.19it/s]
 50%|████▉     | 496/1000 [00:13<00:08, 61.58it/s]
 51%|█████     | 511/1000 [00:14<00:14, 34.89it/s]
 55%|█████▌    | 551/1000 [00:15<00:12, 36.46it/s]
 56%|█████▌    | 560/1000 [00:15<00:12, 35.98it/s]
 60%|██████    | 601/1000 [00:16<00:10, 37.37it/s]
 61%|██████    | 607/1000 [00:17<00:11, 35.33it/s]
 65%|██████▌   | 651/1000 [00:18<00:09, 38.25it/s]
 66%|██████▌   | 656/1000 [00:18<00:09, 35.48it/s]
 70%|███████   | 701/1000 [00:19<00:07, 38.84it/s]
 70%|███████   | 705/1000 [00:19<00:08, 35.57it/s]
 75%|███████▌  | 751/1000 [00:20<00:06, 39.55it/s]
 76%|███████▌  | 755/1000 [00:21<00:06, 35.85it/s]
 80%|████████  | 801/1000 [00:22<00:04, 39.96it/s]
 80%|████████  | 805/1000 [00:22<00:05, 35.90it/s]
 85%|████████▌ | 850/1000 [00:22<00:02, 62.79it/s]
 86%|████████▋ | 863/1000 [00:23<00:03, 35.12it/s]
 90%|█████████ | 901/1000 [00:24<00:02, 36.70it/s]
 91%|█████████ | 909/1000 [00:25<00:02, 34.44it/s]
 95%|█████████▌| 951/1000 [00:26<00:01, 38.06it/s]
 96%|█████████▌| 957/1000 [00:26<00:01, 34.79it/s]
100%|██████████| 1000/1000 [00:26<00:00, 37.90it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     1000      
Failed requests:                         0         
Maximum request concurrency:             50        
Benchmark duration (s):                  26.39     
Total input tokens:                      1024000   
Total generated tokens:                  128000    
Request throughput (req/s):              37.90     
Output token throughput (tok/s):         4850.85   
Peak output token throughput (tok/s):    6328.00   
Peak concurrent requests:                100.00    
Total token throughput (tok/s):          43657.62  
---------------Time to First Token----------------
Mean TTFT (ms):                          323.85    
Median TTFT (ms):                        338.10    
P99 TTFT (ms):                           609.45    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          7.81      
Median TPOT (ms):                        7.80      
P99 TPOT (ms):                           9.81      
---------------Inter-token Latency----------------
Mean ITL (ms):                           7.81      
Median ITL (ms):                         6.04      
P99 ITL (ms):                            84.92     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          1315.12   
Median E2EL (ms):                        1309.30   
P99 E2EL (ms):                           1458.35   
==================================================